{
  "hero1": {
    "hash": "{\"name\":\"🟩・sparkle・✨\",\"image\":\"https://i.ytimg.com/vi/UOyfe_3OqNE/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLAzd-0OCrVlu8HQ8AGNu6Zmn2zggg\",\"tips\":\"Tips to Master Sparkle\\n\\n1. Health and Reload Speed\\nPrioritize gear that boosts Sparkle’s health and reload speed, especially if you don’t have her personal gear yet. These stats greatly improve her survivability and combat efficiency.\\n\\n2. Healing Advantage\\nActivate Sparkle’s healing ability early in a match to gain an instant armor boost. This saves precious time you’d otherwise spend looking for armor pickups.\\n\\n3. Smart Grenade Usage\\nAvoid throwing grenades in close-quarters combat. They can easily backfire and cause damage to yourself or teammates — use them from a safe distance instead.\\n\\n4. Positioning and Movement\\nStay close to walls and cover to protect yourself from enemy fire. When possible, flank enemies to take them by surprise.\\n\\n5. Gear Recommendations\\nBefore unlocking Sparkle’s personal gear, aim for a balanced setup that includes Reload Speed, Movement Speed, HP, and Vision gear. This combination keeps you agile and durable on the battlefield.\\n\\n6. Practice Makes Perfect\\nUse King of the Hill mode to practice Sparkle’s abilities. It’s an excellent way to master her mechanics and learn efficient timing for her skills.\\n\\n7. Know When to Retreat\\nIf you’re caught in point-blank encounters or rushed unexpectedly, don’t hesitate to fall back and find cover. Staying alive is often more important than finishing a risky fight.\"}",
    "messageId": "1447974411557671035"
  },
  "hero2": {
    "hash": "{\"name\":\"🟩・cyclops・\",\"image\":\"https://preview.redd.it/is-it-just-me-or-cyclops-isnt-really-a-demon-v0-z4kyv2vsr01g1.jpeg?auto=webp&s=0329d81e9a802f15891b4ca48caac5422a8a0d6b\",\"tips\":\"Tips for Playing Cyclops\\n\\n1. Master the Scan Ability\\nUse Cyclops’s scan ability to scout ahead and reveal enemy positions. This gives your team a strategic advantage by preventing ambushes and allowing better positioning.\\n\\n2. Shotgun Usage\\nRely on his shotgun for close to medium-range combat, where it’s most effective. Keep in mind its limited range — avoid engaging long-distance targets unless necessary.\\n\\n3. Use Cover Wisely\\nStay close to walls and corners to safely peek and shoot. This tactic increases your shotgun’s effectiveness while minimizing exposure to enemy fire.\\n\\n4. Healing on the Move\\nActivate his heal ability while running to maintain mobility and maximize survivability during heated fights or when retreating.\\n\\n5. Secure the First Shot\\nAim to land the first shot in any encounter. This early damage can tip the fight in your favor and often force enemies to retreat or lose accuracy.\"}",
    "messageId": "1447974412593664010"
  },
  "hero4": {
    "hash": "{\"name\":\"🟩・Molly・\",\"image\":\"https://static.wikia.nocookie.net/bullet-echo/images/7/7f/Molly_in_game_photo.jpg/revision/latest?cb=20240818133217\",\"tips\":\"Tips for Playing Molly\\n\\n1. Ambush and Disarm Mastery\\nMolly excels at burrowing underground to ambush enemies. While underground, detect footsteps, then resurface to disarm foes in an area — her core strength for disrupting fights.\\n\\n2. Vision and Footstep Tracking\\nUse underground vision to spot enemy footsteps from afar. This lets you track movements precisely and set up perfectly timed ambushes.\\n\\n3. Escape and Scouting\\nBurrow to escape danger or scout ahead safely. It provides crucial intel on enemy positions without exposing yourself.\\n\\n4. Gear Recommendations\\nProtective Glasses: Boosts vision range for earlier footstep detection.\\nInfantry Test: Increases health for better survivability in close calls.\\nReflex Implant: Reduces firing spread, ideal for aggressive playstyles.\\n\\n5. Strategic Ability Timing\\nTime burrowing for maximum impact — ambush, disarm, or flee. Watch the cooldown and surface carefully to avoid vulnerability.\\n\\n\"}",
    "messageId": "1447974413558612130"
  },
  "hero3": {
    "hash": "{\"name\":\"🟩・hurricane・\",\"image\":\"https://i.ytimg.com/vi/qSe6PE5Lpco/hqdefault.jpg\",\"tips\":\"Tips for Playing Hurricane\\n\\n1. Shield Discipline\\nUse the shield to block enemy fire while advancing or repositioning. Avoid charging directly into enemies — maintain a safe distance to maximize protection and control the pace of the fight.\\n\\n2. Pistol Mastery\\nThe pistol excels in close-range combat. Switch to it when enemies get too close, when your primary weapon runs out of ammo, or when you need a quick burst of damage.\\n\\n3. Gear Optimization\\nCommon Gear: Choose Thug Knuckle for increased damage or White Index Collar for higher fire rate and movement speed.\\nPersonal Gear: Focus on increased health, reduced recoil, and improved vision to enhance shield usage and survivability.\\n\\n4. Optimal Playstyle\\nEngage in close-quarters combat where the shield and pistol are most effective.\\nUse the shield to close the gap on ranged heroes or to defend against ambushes.\\nAlways be aware of your surroundings and avoid getting caught in open areas where you’re exposed.\\n\\n\"}",
    "messageId": "1447974414564982795"
  },
  "hero5": {
    "hash": "{\"name\":\"🟩・Satoshi・\",\"image\":\"https://i.ytimg.com/vi/N2PDqCKulS0/sddefault.jpg\",\"tips\":\"Tips for Playing Satoshi\\n\\n1. Shield Mastery\\nLearn efficient shield placements that cover multiple angles at once for maximum protection.\\nMaster shield flicking to quickly deploy and reposition your shield during fights.\\nExploit the shield range boost to control space and block enemy fire from unexpected directions.\\n\\n2. Game Sense Essentials\\nAvoid open spaces: Always move around corners. Hover your finger over the shield button in exposed areas — your survival depends on it against aggressive heroes like Mirage.\\nTeam Support: Time your team heal perfectly to keep allies alive during key moments.\\nDeploy the heal drone on Satoshi himself for sustained pressure in fights.\\n\\n3. Combat Fundamentals\\nMaster Satoshi's firing pattern to land consistent damage.\\nEquip a strong gearset that complements his shield and healing playstyle (focus on health, reload, and utility).\\n\\n\"}",
    "messageId": "1447974415915810827"
  },
  "hero6": {
    "hash": "{\"name\":\"🟩・Alice・\",\"image\":\"https://i.ytimg.com/vi/e2DR2_C3YS8/maxresdefault.jpg\",\"tips\":\"Tips for Playing Alice 🧛‍♀️\\n\\n1. Portal Combo Mastery\\nShoot a portal dart at an enemy, activate to blink on top, immediately use your slow skill, then unload primary fire while your passive heals you. This classic combo maximizes surprise and sustain.\\n\\n2. Core Portal Strategies\\nFlank & Chase: Use portals to quickly flank, pursue weak enemies, or escape.\\nSpeed & Damage Reduction: Exiting a portal grants 40% speed boost + 30% damage reduction — combine with health stims for godlike mobility.\\nSlow Enemies: Fire darts at ground/obstacles to create slowing energy fields that lock down targets for easy kills.\\nTeam Utility: Place portals for fast map navigation or to cover blind spots.\\n\\n3. Gear & Playstyle Essentials\\nMap Awareness: Learn layouts, spawns, and chokepoints for perfect portal timing.\\nPrioritize Accuracy: Speed matters, but consistent shots win fights faster.\\nAggressive Mid-Range: Excel at close-mid fights — initiate with advantage, sustain via passive healing.\\nRhythm Talent: Boosts nearby allies' recharge, damage, and stealth — coordinate team plays.\\n\\n4. Survival & Game Sense\\nSmart Retreats: Despite high regen/mobility, Alice is squishy. Portal out when swarmed or losing.\\nAvoid Predictability: Don't run mindlessly — use environment, choose engagements wisely to prevent flanks.\"}",
    "messageId": "1447974434366427300"
  }
}